backend/app/Controllers/ApiController.php

SELECT `messages`.*, `users`.`username`, `users`.`nickname`, `users`.`avatar`, `message_status`.`status`
FROM `messages`
JOIN `users` ON `users`.`id` = `messages`.`sender_id`
LEFT JOIN `message_status` ON `messages`.`id` = `message_status`.`message_id`
WHERE `messages`.`is_group` = 0
AND   (
   (
`messages`.`sender_id` = '1'
AND `messages`.`receiver_id` = '2'
  )
OR    (
`messages`.`sender_id` = '2'
AND `messages`.`receiver_id` = '1'
  )
 )
ORDER BY `messages`.`created_at` ASC
---
    public function getDirectMessages($otherUserId)
    {
        $userId = session()->get('id');

        if (!$userId) {
            return $this->setCorsHeaders()->setStatusCode(401)->setJSON(['error' => 'User not authenticated']);
        }

        try {
            // Log the request parameters for debugging
            log_message('debug', "Getting direct messages between user $userId and $otherUserId");

            // Get direct messages with explicit ordering and conditions
            $messages = $this->messageModel
                ->select('messages.*, users.username, users.nickname, users.avatar, message_status.status')
                ->join('users', 'users.id = messages.sender_id')
                ->join('message_status', 'messages.id = message_status.message_id', 'left')
                ->where('messages.is_group', 0)
                ->groupStart()
                    ->groupStart()
                        ->where('messages.sender_id', $userId)
                        ->where('messages.receiver_id', $otherUserId)
                    ->groupEnd()
                    ->orGroupStart()
                        ->where('messages.sender_id', $otherUserId)
                        ->where('messages.receiver_id', $userId)
                    ->groupEnd()
                ->groupEnd()
                ->orderBy('messages.created_at', 'ASC')
                ->findAll();

SELECT *
FROM `messages`
WHERE `sender_id` = '2'
AND `receiver_id` = '1'
AND `is_group` = 0
AND `is_read` = 0
UPDATE `messages` SET `is_read` = 1
WHERE `sender_id` = '2'
AND `receiver_id` = '1'
AND `is_group` = 0
---
    private function markDirectMessagesAsRead($userId, $otherUserId)
    {
        try {
            // Get all unread messages from the other user to current user
            $unreadMessages = $this->messageModel
                ->where('sender_id', $otherUserId)
                ->where('receiver_id', $userId)
                ->where('is_group', 0)
                ->where('is_read', 0)
                ->findAll();

            // Mark all messages as read
            $this->messageModel->where('sender_id', $otherUserId)
                ->where('receiver_id', $userId)
                ->where('is_group', 0)
                ->set(['is_read' => 1])
                ->update();

SELECT *
FROM `users`
WHERE `id` != '1'
SELECT `messages`.*
FROM `messages`
WHERE `messages`.`is_group` = 0
AND   (
   (
`messages`.`sender_id` = '1'
AND `messages`.`receiver_id` = '2'
  )
OR    (
`messages`.`sender_id` = '2'
AND `messages`.`receiver_id` = '1'
  )
 )
ORDER BY `messages`.`created_at` DESC
 LIMIT 1
---
    public function getUsers()
    {
        $currentUserId = session()->get('id');

        if (!$currentUserId) {
            return $this->setCorsHeaders()->setStatusCode(401)->setJSON(['error' => 'User not authenticated']);
        }

        try {
            // Get all users except current user
            $users = $this->userModel
                ->where('id !=', $currentUserId)
                ->findAll();

            // Add last message and unread count for each user
            foreach ($users as &$user) {
                // Get last message between current user and this user
                $lastMessage = $this->messageModel
                    ->select('messages.*')
                    ->where('messages.is_group', 0)
                    ->groupStart()
                        ->groupStart()
                            ->where('messages.sender_id', $currentUserId)
                            ->where('messages.receiver_id', $user['id'])
                        ->groupEnd()
                        ->orGroupStart()
                            ->where('messages.sender_id', $user['id'])
                            ->where('messages.receiver_id', $currentUserId)
                        ->groupEnd()
                    ->groupEnd()
                    ->orderBy('messages.created_at', 'DESC')
                    ->first();

SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `sender_id` = '2'
AND `receiver_id` = '1'
AND `is_group` = 0
AND `is_read` = 0
---

                // Get unread message count for this user - handle missing is_read column
                try {
                    $unreadCount = $this->messageModel
                        ->where('sender_id', $user['id'])
                        ->where('receiver_id', $currentUserId)
                        ->where('is_group', 0)
                        ->where('is_read', 0)
                        ->countAllResults();

SELECT `groups`.*, COUNT(group_members.id) as member_count
FROM `groups`
JOIN `group_members` ON `groups`.`id` = `group_members`.`group_id`
WHERE `group_members`.`user_id` = '1'
GROUP BY `groups`.`id`
---
    public function getUserGroups()
    {
        $currentUserId = session()->get('id');

        if (!$currentUserId) {
            return $this->setCorsHeaders()->setStatusCode(401)->setJSON(['error' => 'User not authenticated']);
        }

        try {
            // Get groups the user is a member of
            $groups = $this->groupModel
                ->select('groups.*, COUNT(group_members.id) as member_count')
                ->join('group_members', 'groups.id = group_members.group_id')
                ->where('group_members.user_id', $currentUserId)
                ->groupBy('groups.id')
                ->findAll();

SELECT `id`, `username`, `nickname`, `status`
FROM `users`
---
    public function getAllUserStatuses()
    {
        $currentUserId = session()->get('id');

        if (!$currentUserId) {
            return $this->setCorsHeaders()->setStatusCode(401)->setJSON(['error' => 'User not authenticated']);
        }

        try {
            // Get all users with their statuses
            $users = $this->userModel
                ->select('id, username, nickname, status')
                ->findAll();

SELECT *
FROM `tickets`
WHERE `created_by` = '1'
AND `is_deleted` = 0
ORDER BY `created_at` DESC
---
    public function getUserTickets()
    {
        $userId = session()->get('id');
        if (!$userId) {
            return $this->setCorsHeaders()->setStatusCode(401)->setJSON(['error' => 'Authentication required']);
        }

        try {
            $ticketModel = new \App\Models\TicketModel();
            $tickets = $ticketModel->where('created_by', $userId)
                                   ->where('is_deleted', 0)
                                   ->orderBy('created_at', 'DESC')
                                   ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '1'
AND `read_at` IS NULL
---
public function unreadNotificationsCount()
{
    $userId = session()->get('id');

    if (!$userId) {
        return $this->response->setJSON(['count' => 0]);
    }

    $db = \Config\Database::connect();
    $count = $db->table('notifications')
                ->where('user_id', $userId)
                ->where('read_at', null)
                ->countAllResults();

SELECT `call_logs`.*, IF(call_logs.caller_id = 1, `r`.`nickname`, c.nickname) as other_name, IF(call_logs.caller_id = 1, `r`.`avatar`, c.avatar) as other_avatar, IF(call_logs.caller_id = 1, `r`.`id`, c.id) as other_id, CASE 
                        WHEN call_logs.status = 'missed' THEN 'Missed call'
                        WHEN call_logs.status = 'rejected' THEN 'Declined'
                        WHEN call_logs.caller_id = 1 THEN 'Outgoing call'
                        ELSE 'Incoming call'
                    END as status_label
FROM `call_logs`
LEFT JOIN `users` `c` ON `c`.`id` = `call_logs`.`caller_id`
LEFT JOIN `users` `r` ON `r`.`id` = `call_logs`.`receiver_id`
WHERE   (
`call_logs`.`caller_id` = '1'
OR `call_logs`.`receiver_id` = '1'
 )
ORDER BY `call_logs`.`created_at` DESC
 LIMIT 20
---
    public function getCallLogs()
    {
        $userId = session()->get('id');
        if (!$userId) {
            return $this->setCorsHeaders()->setStatusCode(401)->setJSON(['error' => 'User not authenticated']);
        }

        try {
            $db = \Config\Database::connect();
            $logs = $db->table('call_logs')
                ->select("
                    call_logs.*,
                    IF(call_logs.caller_id = $userId, r.nickname, c.nickname) as other_name,
                    IF(call_logs.caller_id = $userId, r.avatar, c.avatar) as other_avatar,
                    IF(call_logs.caller_id = $userId, r.id, c.id) as other_id,
                    CASE
                        WHEN call_logs.status = 'missed' THEN 'Missed call'
                        WHEN call_logs.status = 'rejected' THEN 'Declined'
                        WHEN call_logs.caller_id = $userId THEN 'Outgoing call'
                        ELSE 'Incoming call'
                    END as status_label
                ")
                ->join('users c', 'c.id = call_logs.caller_id', 'left')
                ->join('users r', 'r.id = call_logs.receiver_id', 'left')
                ->groupStart()
                    ->where('call_logs.caller_id', $userId)
                    ->orWhere('call_logs.receiver_id', $userId)
                ->groupEnd()
                ->orderBy('call_logs.created_at', 'DESC')
                ->limit(20)
                ->get()
                ->getResult();