backend/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE   (
`username` = 'admin'
OR `email` = 'admin'
 )
 LIMIT 1
---
    public function attemptLogin()
    {
        // 1. Update Rules to reflect "Username OR Email"
        $rules = [
            'username' => [
                'label'  => 'Username or Email',
                'rules'  => 'required',
                'errors' => [
                    'required' => 'Please enter your username or email address.'
                ]
            ],
            'password' => [
                'rules'  => 'required',
                'errors' => [
                    'required' => 'Please enter your password.'
                ]
            ]
        ];

        // 2. Validate Inputs
        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        try {
            // Get the input (which could be a username OR an email)
            $loginInput = $this->request->getPost('username');
            $password   = $this->request->getPost('password');

            // 3. UPDATED QUERY: Check both 'username' AND 'email' columns
            $user = $this->userModel
                         ->groupStart()
                             ->where('username', $loginInput)
                             ->orWhere('email', $loginInput)
                         ->groupEnd()
                         ->first();

UPDATE `users` SET `status` = 'online', `last_active` = '2026-02-14 00:14:59', `updated_at` = '2026-02-14 00:14:59'
WHERE `users`.`id` IN ('1')
---
            session()->set($userData);

            // 6. Update Status
            $this->userModel->update($user['id'], [
                'status'      => 'online',
                'last_active' => date('Y-m-d H:i:s')
            ]);