backend/app/Controllers/Chat.php

    public function directChat($userId)
    {
        // Check if user exists
        $user = $this->userModel->find($userId);

        if (!$user) {
            return redirect()->to('/chat')->with('error', 'User not found');
        }

        // Get messages between current user and selected user
        $currentUserId = session()->get('id');

        $messages = $this->messageModel
            ->select('messages.*, users.username, users.nickname, users.avatar')
            ->join('users', 'users.id = messages.sender_id')
            ->where('messages.is_group', 0)
            ->groupStart()
                ->groupStart()
                    ->where('messages.sender_id', $currentUserId)
                    ->where('messages.receiver_id', $userId)
                ->groupEnd()
                ->orGroupStart()
                    ->where('messages.sender_id', $userId)
                    ->where('messages.receiver_id', $currentUserId)
                ->groupEnd()
            ->groupEnd()
            ->orderBy('messages.created_at', 'ASC')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT `messages`.*, `users`.`username`, `users`.`nickname`, `users`.`avatar`
FROM `messages`
JOIN `users` ON `users`.`id` = `messages`.`sender_id`
WHERE `messages`.`is_group` = 0
AND   (
   (
`messages`.`sender_id` = '1'
AND `messages`.`receiver_id` = '2'
  )
OR    (
`messages`.`sender_id` = '2'
AND `messages`.`receiver_id` = '1'
  )
 )
ORDER BY `messages`.`created_at` ASC