backend/app/Views/partials/sidebar.php

    <?php
    $db = \Config\Database::connect();
    if ($db->tableExists('ticket_categories')) {
        $categories = $db->table('ticket_categories')
                         ->where('is_active', 1)
                         ->get()
                         ->getResultArray();
---
SELECT *
FROM `ticket_categories`
WHERE `is_active` = 1